---
kind: type
id: T:Autodesk.Revit.DB.Structure.ReinforcementBarOrientation
source: html/b67e1240-752a-316d-0e41-2000d19aa088.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementBarOrientation

Describes the bar orientation at Path Reinforcement.

## Syntax (C#)
```csharp
public enum ReinforcementBarOrientation
```